REPLIES_TO_UNKNOWN_COMMAND: [str] = [
    "Список команд можно увидеть, введя * / * (не отправляй! просто введи)",
    "Введи * / *, но не отправляй, и ты увидишь спиосок поддерживаемых команд. А твою я не знаю🙅🏼‍♀️",
    "Я понимаю лишь несколько команд. Они доступны после ввода * / * (не отправлять, только ввести)",
    "_«Не любая команда — команда»_ — [Создатель](https://telegram.me/airatk)."
]

REPLIES_TO_UNKNOWN_MESSAGE: [str] = [
    "Не понимаю!",
    "Не делай так, я отвечаю лишь на определённые команды.",
    "Если ты думаешь, что это весело — писать мне непонятные сообщения, то нет.",
    "Ўт тЅЁЅ! тЎЁы Ј тЅЁЅ ЁыЋЎ ­ЅЏЎ­ят­Ў!",
    "А может, ты лучше команду введёшь?",
    "_«Самолёт должен быть красивым, чтобы он полетел»_ — Андрей Николаевич Туполев.",
    "Я не умею отвечать на естественные сообщения — я же всего лишь глупый алгоритм.",
    "🙃",
    (
        "Пау, чика, пау-уау — я напева-а-ю;\n"
        "Мау-мау-мау, моё сердце страдает,\n"
        "Чики-чики-чуа-а, и сно-ва:\n"
        "Гичи-гичи-гу — значит, я люблю!"
    ),
    "🙅🏼‍♀️",
    "К чёрту всё! Я люблю тебя!😚",
    "Целовались студееенты, распускались тюльпаааны, чикчири-ка-ло там и тут… Ой, ты ещё здесь?",
    "Монеточка — лучшая исполнительница современной музыкальной культуры.",
    "Алишер Моргенштерн — попса.",
    "_«Чудо нельзя в своих подвалах скрывать. Сложилось — надо на свет выпускать. »_"
]
